app/controllers/events_controller.rb

INSERT INTO "events" ("title", "start", "end", "location", "ispublic", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "title" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "Dinosaurs After Dark"], ["updated_at", "2017-10-25 04:40:16.308615"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)